src/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Скидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Скидки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураНоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ЦеныСервер/Ext/Module.bsl
Функция ЦенаНаДату(Номенклатура, Дата) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
				|	ЦеныСрезПоследних.Цена КАК Цена
				|ИЗ
				|	РегистрСведений.Цены.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

Функция СкидкаНаДату(Номенклатура, Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкидкиСрезПоследних.Скидка КАК Скидка
	               |ИЗ
	               |	РегистрСведений.Скидки.СрезПоследних(&Дата, НоменклатураНоменклатурнаяГруппа = &Номенклатура) КАК СкидкиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СкидкиСрезПоследних.Скидка КАК Скидка
		               |ИЗ
		               |	РегистрСведений.Скидки.СрезПоследних(
		               |			&Дата,
		               |			НоменклатураНоменклатурнаяГруппа В
		               |				(ВЫБРАТЬ
		               |					НоменклатурныеГруппы.Ссылка КАК Ссылка
		               |				ИЗ
		               |					Справочник.Номенклатура КАК Номенклатура
		               |						ПОЛНОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
		               |						ПО
		               |							Номенклатура.НоменклатурнаяГруппа = НоменклатурныеГруппы.Ссылка
		               |				ГДЕ
		               |					Номенклатура.Ссылка = &Номенклатура)) КАК СкидкиСрезПоследних"; 
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
		Результат = Запрос.Выполнить();
	КонецЕсли;

	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий()Тогда
		Возврат Выборка.Скидка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции
